# IsToOtherRebar Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..IsToOtherRebar Method
RebarConstraint Class See Also
---
Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar.'
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsToOtherRebar()
```

Visual Basic
---
```text
Public Function IsToOtherRebar As Boolean
```

Visual C++
---
```text
public:
bool IsToOtherRebar()
```

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace